import logo from "./logo.svg";
import "./App.css";
import Navbar from "./components/Navbar";
import { BrowserRouter, Routes, Route, Navigate } from "react-router-dom";
import Home from "./components/Home";
import Characters from "./pages/Characters";
import CharacterDetails from "./pages/CharacterDetails";
import Profile from "./pages/Profile";
import Programming from "./pages/Programming";
import Search from "./pages/Search";
import { useState } from "react";

function App() {
  const [login, setLogin] = useState(false);

  const characters = [
    {
      name: "أمجد",
      img: "https://pbs.twimg.com/media/EScj838XsAIw4re?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart02_march5_2020.png",
      details:
        "تايتشي المعروف في الدبلجة العربيّة بـأمجد (باليابانية:八神 太一) (بالروماجي:Taichi Yagami)، هُو فتى في الصف الخامس يبلغ من العمر إحدى عشر عاماً وهو الشخصية الرئيسية في المُسلسل، كما أنه الشقيق الأكبر لهيكاري (هند) أحد أبطال الديجيتال الثمانيّة، يُعتبر تايتشي قائداً للمجموعة بسبَب علاقاته المتينة ومحبته مع الجميع وشجاعته في اتخاذ القرارات، على الرّغم من طيّشه وتهوّره إلا أن المجموعة ليس بمقدورها فِعلَ شيءٍ من دونه وظهر ذلك جلياً حينما سحبه تيارٌ نابعٌ من بُعدٍ رقمي إلى العالم الحقيقي في الحلقة 20 (تطور المستوى المثالي! ميتال قريمون)؛ حين افترقت المجموعة بعد أن غاب عنهم لفترة دامت أكثر من شهر وفوّرَ عودته قام بِلَم شتات المجموعة، عنيدٌ أحياناً ولا يُبالي بالخطر الذي قد يُصيبه نتيجةَ قراراته الطائشة، وعلى الرغم من ذلك، فإن تايتشي طيّب الأخلاق ومُتعاون واجتماعي وكذلك حنونٌ مع الجميع خاصةً شقيقته هند، كما يملك أمجد روحاً مرحة وفُكاهيّة حتى في المواقف الصعبة التي تتطلب الجديّة في الكثير من الأحيان، وبصرف النظر عن كونه قائدً لمجموعة أبطال الديجيتال فإن تايتشي بارعٌ في كرة القدم في مدرسته وكان نجمَ فريقه في أحد أندية كرة القدم للمدارس، شكَّل تايتشي ثُنائياً مرحاً مع أقومون (رعد) وخاضا الكثير من المعارك لوحدهِما حيث يُعتبران أفضل ثنائي بين بطل الديجيتال وشريكه، يَملك تايتشي شارة الشجاعة في قلادته التيّ توهجت بفضل شجاعته في مروره في التيّار الكهربائي في هرم شبكة إيتيمون (قردون).",
      id: 1,
    },
    {
      name: "هند",
      img: "https://pbs.twimg.com/media/EScj-PaWkAQnKuA?format=png&name=small",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart16_march5_2020.png",
      details:
        "هيكاري (باليابانية:八神 ヒカリ ) (بالروماجي:Yagami Hikari)، المعروف في الدبلجة العربية بـهند هي فتاة يابانية تبلغ من العُمر 8 أعوام وتدرس في الصف الثاني، وهي الشقيقة الصُغرى لتايتشي (أمجد) أحد أبطال الديجيتال وتعتبره مثالاً ومصدر إلهام لها، عاشت فترةً من حياتها في هيكاريغاوكا قبل أن تنتقل مع أسرتها إلى مدينة أودايبا، الاسم هيكاري يعني الضوء، وهو نفس اسم مفتاح قلادتها، هيكاري رقيقة للغايّة وهادئة، ومُنذ صغرها وهي عُرضةٌ للأمراض الحساسة، هيكاري لديّها طاقةٌ خاصة تنتج عن طريق النور، وظهر واضحاً في كثير من الأحيان، هيكاري فتاةٌ لطيفة للغاية، ومهذبة وخلوقة، كما أنها في غاية الهدوء، ونادر جداً ما تغضب، وهي فتاة عاطفيّة ورحيمة جداً ولا تستحمل أي صورة من صور التدمير، تُحب الاعتناء بالحيوانات والمخلوقات الرقمية، وتعطف على الضعفاء والصغار، وتُحب الخير وتكره الشر وعواقبه، رُغم وأن لها قلباً عاطفياً فإنها تغضب عندما ترى أي صورةٍ من صوّر الظُلم أو الغرور والتسلط على حساب الضُعفاء، كما أنها كريمةٌ للغايّة وتحب إسعاد غيرها على حساب نفسها، ومتواضعة للغايّة وخلوقة وتُحب المزاح والضحك ولكن بشكلٍ أقل من أخيها، تُربي في منزلها قطة تُسميها ميكو (بيسو في الدبلجة العربية)، تربطها مع مُرافقتها علاقةٌ حميميّة وعميقة، وتحمل شارة النور في قلادتها.",
      id: 2,
    },
    {
      name: "يامن",
      img: "https://pbs.twimg.com/media/EScj9FmWoAMJOC_?format=png&name=900x900",
      avatarImg:
        "https://images.withthewill.net/adventure2020characterart04_march5_2020.png",
      details:
        "ياماتو (باليابانية:石田 ヤマト) (بالروماجي:Ishida Yamato)، المعروف في الدبلجة العربية بـيامن هو فتى في الصف الخامس يبلغُ من العمر إحدى عشرَ عاماً، وهو الشقيق الأكبر لتاكيرو (وسيم) أحد أبطال الديجيتال الثمانية، يعيش ياماتو مع والده في مدينة أودايبا بعد طلاق والديّه، هذا الأمر جعل علاقته مع والدته غيّر مُستقرة بسبب بُعدِه عنها، يُعَد ياماتو أكثر الأولاد جديّةً وعصبيّة؛ فهو سريع الغضب وهادئٌ كثيراً وبارد الأعصاب، ويُنظر إليه على أنه الفتى المتمرد أو الذئب الوحيد الذي يُفضل أن يتعامل مع الأشياء بطريقته الخاصة، مُنعزل ويحب الجلوس بمُفرده في كثير من الأوقات ويهوى العزف في آلتهُ الموسيقية الصغيرة الهارمونيكا كتعبير عن مشاعره، ياماتو هو شخصٌ وُقائي جداً ويخشى على نفسه وعلى الآخرين من مخاطر العالم الرقمي لذلك فإنه كثير الشجار مع تايتشي (أمجد) بسبب تهوّر الأخير في قراراته، يُعتبر ياماتو قائداً ثانوياً للمجموعة بعد تايتشي، على الرّغم من أن ياماتو فتى هادئ وكثير الغضب إلا أنه يملك جانباً حساساً؛ فهو مُحب للجميع ويحرص على مصلحتهم ودفعِ الضرر عنهم، وكثيراً ما يخاف على أخيه تاكيرو ويهتم به اهتماما بالغاً، يُعاب على ياماتو بأنه مُتسرع في الحكم على الآخرين وهذا سبب مُشاجراته الكثيرة، يحمل ياماتو شارة الصداقة في قلادته، على الرّغم من أن ياماتو لا تظهر عليه معاني الصداقة في ظَاهره لكنهُ يحمل معانيها في قلبه خاصةً بعد التجارب التي مرَّ بها في العالم الرقمي.",
      id: 3,
    },
  ];
  return (
    <BrowserRouter>
      <div className="App">
        <Navbar></Navbar>
        <br></br>
        {login ? (
          <button
            onClick={() => {
              setLogin(false);
            }}
          >
            {" "}
            Logout{" "}
          </button>
        ) : (
          <button
            onClick={() => {
              setLogin(true);
            }}
          >
            Login
          </button>
        )}
        <Routes>
          <Route exact path="/" element={<Home></Home>}></Route>
          <Route
            path="/Characters"
            element={<Characters data={characters} />}
          ></Route>
          <Route
            path="/CharacterDetails/:id"
            element={<CharacterDetails data={characters} />}
          ></Route>
          {/* <Route path="/Profile" element={login? <Profile/> :<Navigate to ='/'></Navigate>}>  </Route> */}
          <Route path="/Profile" element={<Profile login={login} />}>
            {" "}
          </Route>
          <Route path="/Programming" element={<Programming />}>
            {" "}
          </Route>
          <Route path="/search" element={<Search />}></Route>
        </Routes>
      </div>
    </BrowserRouter>
  );
}

export default App;
